{
    "Resume": [
        {
            "resume_id": 1,
            "resume_name": "ashlesh resume",
            "resume_data": "----"
        },
        {
            "resume_id": 2,
            "resume_name": "Ashlesh_OfferLetter_latest.pdf",
            "resume_data": "      Date: 12/12/2023        Dear Ashlesh Survi,      We are thrilled to oﬀer the So4ware Engineer Intern posi<on at Samarth Inc. Your comprehensive experience and proﬁciency in a diverse range of technologies, coupled with your impressive educa<onal background and hands-on project involvement, make you an outstanding candidate for this role.      Internship Details:      Posi9on: So4ware Engineer   Intern Start Date: Jan 22nd, 2024.   Intern End Date: April 22nd, 2024.   Dura9on: 3 months   Number of hours per week: - 20 hours   Compensa9on: Unpaid   Loca9on: Remote    Responsibili9es:     As a So4ware Engineer Intern, you will have the opportunity to contribute to our projects and gain valuable hands-on experience. Your responsibili<es will include:   • Collabora<ng with the development team on design, development, and deployment of secure and scalable so4ware applica<ons.   • Par<cipa<ng in all phases of the so4ware development lifecycle, from analysis and design to tes<ng and deployment.   • Assis<ng in the implementa<on of quality assurance prac<ces and procedures, ensuring the con<nual opera<onal quality of our applica<ons.   • U<lizing your exper<se in various programming languages, tools, and methodologies to drive innova<ve solu<ons.      Your previous roles in so4ware development, system lifecycle management, and your ability to integrate diverse technologies to create robust solu<ons. Your contribu<ons to projects using Machine Learning demonstrate your crea<vity and proﬁciency in leveraging technology.         Manager Opera<ons. 1809 Rutgers Ln, Sewickley, PA 15143 Phone: +1 (412) 757-3127.   contactus@samarthinc.net | www.samarthinc.net  \n  \n We are excited about the prospect of having you join our team and believe that your skills and enthusiasm will make a signiﬁcant impact on our ongoing projects. Your leadership experience and community organiza<ons reﬂect your commitment to teamwork, innova<on, and community engagement—all quali<es highly valued at Samarth Inc.      Please review this oﬀer lecer carefully and indicate your acceptance by 11/30/2023. We are conﬁdent that your tenure as a So4ware Engineer Intern will be mutually beneﬁcial and will contribute to your professional growth and development. Mr. Survi will be repor<ng directly to Swetha Ghantoji, Manager of Opera<ons and she can be reached at swetha.g@samarthinc.net      We look forward to welcoming you to Samarth Inc and are eager to witness your contribu<ons to our team.                     Sincerely,          Swetha Ghantoji,                        Manager Opera<ons. 1809 Rutgers Ln, Sewickley, PA 15143 Phone: +1 (412) 757-3127.   contactus@samarthinc.net | www.samarthinc.net   \n"
        },
        {
            "resume_id": 3,
            "resume_name": "No-SPA-Required-Upload.pdf",
            "resume_data": " \n \nAs of June 6, 2023, Student Placement Agreements are no longer required , with very few exceptions , as \npart of the internship course registration process . \n \nFulton Schools Career Center  \n \n"
        },
        {
            "resume_id": 4,
            "resume_name": "Ashlesh_OfferLetter.docx",
            "resume_data": "      Date: 12/12/2023        Dear Ashlesh Survi,      We are thrilled to offer the Software Engineer Intern position at Samarth Inc. Your comprehensive experience and proficiency in a diverse range of technologies, coupled with your impressive educational background and hands-on project involvement, make you an outstanding candidate for this role.      Internship Details:      Position: Software Engineer   Intern Start Date: Jan 22nd, 2024.   Intern End Date: April 22nd, 2024.   Duration: 3 months   Number of hours per week: - 20 hours   Compensation: Unpaid   Location: Remote    Responsibilities:     As a Software Engineer Intern, you will have the opportunity to contribute to our projects and gain valuable hands-on experience. Your responsibilities will include:   Collaborating with the development team on design, development, and deployment of secure and scalable software applications.   Participating in all phases of the software development lifecycle, from analysis and design to testing and deployment.   Assisting in the implementation of quality assurance practices and procedures, ensuring the continual operational quality of our applications.   Utilizing your expertise in various programming languages, tools, and methodologies to drive innovative solutions.      Your previous roles in software development, system lifecycle management, and your ability to integrate diverse technologies to create robust solutions. Your contributions to projects using Machine Learning demonstrate your creativity and proficiency in leveraging technology.         Manager Operations. 1809 Rutgers Ln, Sewickley, PA 15143 Phone: +1 (412) 757-3127.   contactus@samarthinc.net | www.samarthinc.net     We are excited about the prospect of having you join our team and believe that your skills and enthusiasm will make a significant impact on our ongoing projects. Your leadership experience and community organizations reflect your commitment to teamwork, innovation, and community engagement—all qualities highly valued at Samarth Inc.      Please review this offer letter carefully and indicate your acceptance by 11/30/2023. We are confident that your tenure as a Software Engineer Intern will be mutually beneficial and will contribute to your professional growth and development. Mr. Survi will be reporting directly to Swetha Ghantoji, Manager of Operations and she can be reached at swetha.g@samarthinc.net      We look forward to welcoming you to Samarth Inc and are eager to witness your contributions to our team.                     Sincerely,          Swetha Ghantoji,                        Manager Opera<ons. 1809 Rutgers Ln, Sewickley, PA 15143 Phone: +1 (412) 757-3127.   contactus@samarthinc.net | www.samarthinc.net   "
        },
        {
            "resume_id": 5,
            "resume_name": "Ashlesh Resume.pdf",
            "resume_data": "Ashlesh Survi  +1 (602) 545 9503| ashleshsurvi@gmail.com | asurvi@asu.edu | linkedin.com/in/ashlesh-survi-980723210/           Education Master of Information Technology, Arizona State University (ASU), Tempe, AZ, United States                               Aug 2022 - May 2024    Coursework: Information System Development, Advance Database Management Systems, Data Visualization, Analyzing Big data, Cloud Architecture, IOT, Principle of Computer & Architecture, Introducing AI into CyberSecurity.   Bachelor of Engineering: Electronics and Communication Engineering, Vidya Jyothi Institute Of Technology (JNTU), Telangana, India.                         Aug 2017-Nov 2021   SKILLS Languages/Tools: Python, Django, SQLAlchemy, RPA, BPMN, Postman, HTML, CSS, JavaScript, JSON, Java, C, Dart, Bootstrap, ReactJs, Node.js, Express.js, Web API, Restful services, C#, Microsoft Visual Studio, GIT Extensions, JIRA, Tableau.  • Databases: SQL Server, MySQL, PostgreSQL, Oracle, Mongo DB.    • Industry Expertise: Banking, Financial Services, E-commerce, Public Safety, Health Care.  • Testing: Unit Testing, Pytest, Selenium, Mocha. • Hosting: Azure, AWS, PythonAnywhere. • DevOps: Jenkins, Kubernetes, Docker, CI/CD, AWS Code Pipeline, GIT hub action.  • Operating Systems: Windows, Linux, Unix  • Other Tools and Methodologies: MS Office, Jira, Chrome Developer Tool. Windows Movie Maker, NPM and Bower, Web Services (Soap, Restful), Postman, MS Excel, DBeaver, Powerpoint, Couchbase Server, OCR/ML, Pandas, Numpy, Pre-processing, Post-processing techniques, OOPS, Encryption and Decryption (Security), Adobe Photoshop, UI Path.  PROFESSIONAL EXPERIENCE:  Talent IT                                                                                                   May 2023 – Aug 2023   Software Engineer Responsibilities:  • Participate in the design, development and deployment of secure, highly scalable and available Software applications. Impact analysis, troubleshooting, supporting, and monitoring various production applications.  • Involve in design, analysis, development, documentation, testing, deployment, and support of web-based  • applications.  • Understand all aspects of the systems lifecycle including design, analysis, development, documentation, testing, and deployment.  • Ensure continuing operational quality by documenting bug fixes and enhancements assigning tasks to developers.  • testing and releasing updates.  • Define, develop and implement quality assurance practices and procedures, end user test plans and other QA assessment.  • Technologies used are HTML5, CSS3, JSON, JavaScript, Angular, Python, Django, NodeJs, ExpressJs, SQL, MYSQL, Oracle, HTML, XML, etc.  Techforce.ai                                                                                                     May 2019 – July 2022   Product Developer  Responsibilities:  • Contributed to an Agile development team providing regular updates to project managers and the business team.  • Designed and developed the backend of a program using Techforce, Django, Python, SQLAlchemy, OCR, PostgreSQL, and RPA/BPMN flows.   • Integrated databases and applications on an embedded server. Utilized Python and Django to architect and implement REST API interfaces.   • Worked on implementing real-time services and automated tasks using RPA and BPMN. Deployed servers on Amazon for increased availability and scalability.   • Created API services with Django Rest-Framework. Developed responsive applications with server-side validations using Django. Integrated SSO and email APIs.   • Built load-balanced API instances with Django. Used SQLAlchemy for database integration. Implemented OCR for text data extraction and invoice processing. Experienced in e-commerce applications and creating reusable components with Django.   • Developed a cloud-based messaging app. Created RESTful web services for server-client communication. Assisted unit testing and participated in all phases of SDLC. Proficient in pre and post-processing methods. Utilized JIRA for issue tracking and GIT for version control and collaboration.  PROJECTS   House Price Prediction Using Machine Learning  Developed a sophisticated machine learning model for accurately predicting house prices based on various input factors. Utilized a dataset containing location, built-up area, amenities, and other relevant features. Employed Python, scikit-learn, and pandas for data preprocessing, feature engineering, and modeling.    Smart Door Lock Project: IoT Enabled Door Access System  Engineered an IoT-enabled smart door lock system that revolutionizes traditional security measures. Developed using a combination of WiFi, mobile application, camera, and bot integration. Enabled users to remotely lock or unlock their doors via a mobile app, enhancing convenience and security.    ACHIEVEMENTS & ACTIVITIES   • Captain of the college cricket and vice-captain of the college football team, JNTUH.  • Participated in college hackathons (2019), JNTUH.  • A member of “Go GREEN” NGO in college, JNTUH.  • Member of Indian student association, Arizona state university  "
        }
    ]
}